Revit 2027 API
NonContinuousRailInfo.IsValidNonContinuousRailMaterial Method
 Checks whether an ElementId is a valid material Id of a non-continuous rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidNonContinuousRailMaterial(
	ElementId materialId
)
Public Function IsValidNonContinuousRailMaterial (
	materialId As ElementId
) As Boolean
public:
bool IsValidNonContinuousRailMaterial(
	ElementId^ materialId
)
member IsValidNonContinuousRailMaterial :
        materialId : ElementId -> bool
Parameters
materialId ElementId
 The material Id to be checked.
Return Value
Boolean
 True if the ElementId refers to a valid material or it is invalidElementId, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NonContinuousRailInfo Class
Autodesk.Revit.DB.Architecture Namespace